In [37]:
import pandas as pd
import numpy as np

df= pd.read_csv("Titanic_dataset.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [39]:
#Kazada ölenlerin yaş ortalamasını bulunuz
olen_kisiler= df[df["Survived"]==0]

yas_ort=olen_kisiler["Age"].mean()

print("Kazada olen kisilerin yas ortalamasi",yas_ort)

Kazada olen kisilerin yas ortalamasi 30.62617924528302

In [45]:
#Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz
olen_kisiler= df[df["Survived"]==0]

bilet_ort= olen_kisiler["Fare"].mean()
bilet_medyan= olen_kisiler["Fare"].median()
print("Kazada olenlerin bilet fiyatlarinin ortalamasi:",bilet_ort,"medyani:",bilet_medyan)

Kazada olenlerin bilet fiyatlarinin ortalamasi: 22.117886885245902 medyani: 10.5

In [59]:
#Kazada ölen erkeklerin yaş ortalamasını bulunuz

olen_erkekler= df[(df["Survived"]==0) & (df["Sex"]=="male")]
olen_erkek_yas_ort= olen_erkekler["Age"].mean()
print("Kazada ölen erkeklerin yaş ortalaması:",olen_erkek_yas_ort)

Kazada ölen erkeklerin yaş ortalaması: 31.618055555555557

In [63]:
#Kazada ölen kadınların yaş ortalamasını bulunuz

olen_kadinlar= df[(df["Survived"]==0) & (df["Sex"]=="female")]
olen_kadin_yas_ort= olen_kadinlar["Age"].mean()
print("Kazada ölen kadinlarin yaş ortalaması:",olen_kadin_yas_ort)

Kazada ölen kadinlarin yaş ortalaması: 25.046875

In [67]:
#Kazadan kurtulanların yaş ortalamasını bulunuz

kurtulanlar= df[df["Survived"]==1]
kurt_yas_ort= kurtulanlar["Age"].mean()
print("Kazadan kurtulanların yaş ortalaması:",kurt_yas_ort)

Kazadan kurtulanların yaş ortalaması: 28.343689655172415

In [69]:
#Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz
kurtulanlar= df[df["Survived"]==1]
kurt_bilet_ort= kurtulanlar["Fare"].mean()
print("Kazadan kurtulanların bilet fiyatlarının ortalaması:",kurt_bilet_ort)

Kazadan kurtulanların bilet fiyatlarının ortalaması: 48.39540760233918

In [83]:
#Kazadan kurtulan toplam kişi sayısını bulunuz

(df["Survived"]==1).sum()

342

In [75]:
#10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz

kucukler=df[df["Age"]<10]
bilet_medyan= kucukler["Fare"].median()
print("10 yaşından küçüklerin bilet fiyatlarının medyan değeri:",bilet_medyan)

10 yaşından küçüklerin bilet fiyatlarının medyan değeri: 27.0

In [79]:
#1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarının ortalama ve medyanlarını karşılaştırınız. (Pclass değişkeni sınıfları barındırmaktadır.)
sinif1= df[df["Pclass"]==1]
sinif2= df[df["Pclass"]==2]
sinif3= df[df["Pclass"]==3]

sinif1_ort= sinif1["Fare"].mean()
sinif1_medyan=sinif1["Fare"].median()
sinif2_ort=sinif2["Fare"].mean()
sinif2_medyan=sinif2["Fare"].median()
sinif3_ort=sinif3["Fare"].mean()
sinif3_medyan=sinif3["Fare"].median()

print("1.sinif ortalama bilet fiyati:",sinif1_ort,"medyan degeri:",sinif1_medyan)
print("2.sinif ortalama bilet fiyati:",sinif2_ort,"medyan degeri:",sinif2_medyan)
print("3.sinif ortalama bilet fiyati:",sinif3_ort,"medyan degeri:",sinif3_medyan)

#Sinif yukseldikce biletin fiyati bariz olarak artis gostermis. Ortalamalar medyan degerlerinden cok daha buyuk. Bu da ozellikle
#1.sinif yolcularindan bazilarinin biletleri cok pahaliya aldigini gosterir.

1.sinif ortalama bilet fiyati: 84.1546875 medyan degeri: 60.287499999999994
2.sinif ortalama bilet fiyati: 20.662183152173913 medyan degeri: 14.25
3.sinif ortalama bilet fiyati: 13.675550101832993 medyan degeri: 8.05

In [101]:
#Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız. 
#(Örnek: erkekler için; ölen erkeklerin, erkek sayısına bölümü bu oranı vermektedir.
kadin_sayisi= (df["Sex"]=="female").sum()
erkek_sayisi= (df["Sex"]=="male").sum()

olen_kadin_sayisi= ((df["Sex"]=="female") & (df["Survived"]==0)).sum()
olen_erkek_sayisi= ((df["Sex"]=="male") & (df["Survived"]==0)).sum()

olen_kadin_orani= olen_kadin_sayisi/kadin_sayisi
olen_erkek_orani= olen_erkek_sayisi/erkek_sayisi

print("Olen kadin orani:",olen_kadin_orani,",olen erkek orani:",olen_erkek_orani)
print("Olen kadin yuzdelik orani:",olen_kadin_orani*100,",olen erkek yuzdelik orani:",olen_erkek_orani*100)
#Sonuca baktigimizda kadinlarin kurtulma sansi erkeklere oranla 3-4 kat daha yuksek

Olen kadin orani: 0.25796178343949044 ,olen erkek orani: 0.8110918544194108
Olen kadin yuzdelik orani: 25.796178343949045 ,olen erkek yuzdelik orani: 81.10918544194108